***Identifies data*** (i.e. provides metadata) using known indicators, important for analysis, visualization, and interactive console display
* Enables automatic and explicit data alignment
* Allows intuitive getting and setting of subsets of the data set

***Different Choices of Indexing***
* .loc is primarily label based, but may also be used with a boolean array. .loc will raise KeyError when the items are not found. 
* .iloc is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array. .iloc will raise IndexError if a requested indexer is out-of-bounds, except slice indexers which allow out-of-bounds indexing. (this conforms with python/numpy slice semantics)

In [1]:
import numpy as np
import pandas as pd

In [2]:
dates = pd.date_range('1/1/2000', periods = 8)

In [3]:
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])

In [4]:
df

                   A         B         C         D
2000-01-01  0.438670 -0.613345 -0.904896  1.790869
2000-01-02  0.605819  1.343808  1.027653 -0.033098
2000-01-03 -0.624007  0.444364  1.093461 -1.487693
2000-01-04 -0.378021 -1.430854 -0.253452  0.235135
2000-01-05 -0.336679 -0.812917  1.492888  0.051883
2000-01-06 -0.130804 -0.154338  0.937607  0.602401
2000-01-07 -0.425114 -0.231365  0.172443  2.022738
2000-01-08  0.907361 -0.207719  1.819425  1.887831

In [5]:
panel = pd.Panel({'one' : df, 'two' : df - df.mean()})

In [6]:
panel

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 8 (major_axis) x 4 (minor_axis)
Items axis: one to two
Major_axis axis: 2000-01-01 00:00:00 to 2000-01-08 00:00:00
Minor_axis axis: A to D

In [7]:
s = df['A']

In [8]:
s[dates[5]]

-0.13080350106417116

In [9]:
panel['two']

                   A         B         C         D
2000-01-01  0.431516 -0.405549 -1.578037  1.157111
2000-01-02  0.598666  1.551604  0.354512 -0.666856
2000-01-03 -0.631160  0.652159  0.420320 -2.121452
2000-01-04 -0.385174 -1.223058 -0.926593 -0.398624
2000-01-05 -0.343832 -0.605122  0.819747 -0.581875
2000-01-06 -0.137957  0.053457  0.264466 -0.031357
2000-01-07 -0.432267 -0.023569 -0.500698  1.388980
2000-01-08  0.900208  0.000077  1.146284  1.254073

In [10]:
df

                   A         B         C         D
2000-01-01  0.438670 -0.613345 -0.904896  1.790869
2000-01-02  0.605819  1.343808  1.027653 -0.033098
2000-01-03 -0.624007  0.444364  1.093461 -1.487693
2000-01-04 -0.378021 -1.430854 -0.253452  0.235135
2000-01-05 -0.336679 -0.812917  1.492888  0.051883
2000-01-06 -0.130804 -0.154338  0.937607  0.602401
2000-01-07 -0.425114 -0.231365  0.172443  2.022738
2000-01-08  0.907361 -0.207719  1.819425  1.887831

In [11]:
df[['B', 'A']] = df[['A', 'B']]

In [12]:
df

                   A         B         C         D
2000-01-01 -0.613345  0.438670 -0.904896  1.790869
2000-01-02  1.343808  0.605819  1.027653 -0.033098
2000-01-03  0.444364 -0.624007  1.093461 -1.487693
2000-01-04 -1.430854 -0.378021 -0.253452  0.235135
2000-01-05 -0.812917 -0.336679  1.492888  0.051883
2000-01-06 -0.154338 -0.130804  0.937607  0.602401
2000-01-07 -0.231365 -0.425114  0.172443  2.022738
2000-01-08 -0.207719  0.907361  1.819425  1.887831

***Note***
This will not modify df because the column alignment is before value assignment.

In [13]:
df[['A', 'B']]

                   A         B
2000-01-01 -0.613345  0.438670
2000-01-02  1.343808  0.605819
2000-01-03  0.444364 -0.624007
2000-01-04 -1.430854 -0.378021
2000-01-05 -0.812917 -0.336679
2000-01-06 -0.154338 -0.130804
2000-01-07 -0.231365 -0.425114
2000-01-08 -0.207719  0.907361

In [14]:
df.loc[:,['B', 'A']] = df[['A', 'B']]

In [15]:
df[['A', 'B']]

                   A         B
2000-01-01 -0.613345  0.438670
2000-01-02  1.343808  0.605819
2000-01-03  0.444364 -0.624007
2000-01-04 -1.430854 -0.378021
2000-01-05 -0.812917 -0.336679
2000-01-06 -0.154338 -0.130804
2000-01-07 -0.231365 -0.425114
2000-01-08 -0.207719  0.907361

**The correct way is to use raw values**

In [16]:
df.loc[:,['B', 'A']] = df[['A', 'B']].values

In [17]:
df[['A', 'B']]

                   A         B
2000-01-01  0.438670 -0.613345
2000-01-02  0.605819  1.343808
2000-01-03 -0.624007  0.444364
2000-01-04 -0.378021 -1.430854
2000-01-05 -0.336679 -0.812917
2000-01-06 -0.130804 -0.154338
2000-01-07 -0.425114 -0.231365
2000-01-08  0.907361 -0.207719

***Attribute Access***
You may access an index on a Series, column on a DataFrame, and an item on a Panel directly as an attribute:

In [18]:
sa = pd.Series([1,2,3], index = list('abc'))

In [19]:
dfa = df.copy()

In [20]:
sa.a

1

In [21]:
dfa.A

2000-01-01    0.438670
2000-01-02    0.605819
2000-01-03   -0.624007
2000-01-04   -0.378021
2000-01-05   -0.336679
2000-01-06   -0.130804
2000-01-07   -0.425114
2000-01-08    0.907361
Freq: D, Name: A, dtype: float64

In [22]:
panel.one

                   A         B         C         D
2000-01-01  0.438670 -0.613345 -0.904896  1.790869
2000-01-02  0.605819  1.343808  1.027653 -0.033098
2000-01-03 -0.624007  0.444364  1.093461 -1.487693
2000-01-04 -0.378021 -1.430854 -0.253452  0.235135
2000-01-05 -0.336679 -0.812917  1.492888  0.051883
2000-01-06 -0.130804 -0.154338  0.937607  0.602401
2000-01-07 -0.425114 -0.231365  0.172443  2.022738
2000-01-08  0.907361 -0.207719  1.819425  1.887831

In [23]:
# Changing the first index
sa.a = 6

In [24]:
sa

a    6
b    2
c    3
dtype: int64

In [25]:
dfa.A = list(range(len(dfa.index)))

In [26]:
dfa

            A         B         C         D
2000-01-01  0 -0.613345 -0.904896  1.790869
2000-01-02  1  1.343808  1.027653 -0.033098
2000-01-03  2  0.444364  1.093461 -1.487693
2000-01-04  3 -1.430854 -0.253452  0.235135
2000-01-05  4 -0.812917  1.492888  0.051883
2000-01-06  5 -0.154338  0.937607  0.602401
2000-01-07  6 -0.231365  0.172443  2.022738
2000-01-08  7 -0.207719  1.819425  1.887831

In [27]:
dfa['A'] = list(range(len(dfa.index))) # use this form to create a new column

In [28]:
dfa

            A         B         C         D
2000-01-01  0 -0.613345 -0.904896  1.790869
2000-01-02  1  1.343808  1.027653 -0.033098
2000-01-03  2  0.444364  1.093461 -1.487693
2000-01-04  3 -1.430854 -0.253452  0.235135
2000-01-05  4 -0.812917  1.492888  0.051883
2000-01-06  5 -0.154338  0.937607  0.602401
2000-01-07  6 -0.231365  0.172443  2.022738
2000-01-08  7 -0.207719  1.819425  1.887831

****Warning****
* You can use this access only if the index element is a valid python identifier, e.g. s.1 is not allowed. See here for an explanation of valid identifiers.
* The attribute will not be available if it conflicts with an existing method name, e.g. s.min is not allowed.
* Similarly, the attribute will not be available if it conflicts with any of the following list: index, major_axis, minor_axis, items, labels.
* In any of these cases, standard indexing will still work, e.g. s['1'], s['min'], and s['index'] will access the corresponding element or column.

*If you are using the IPython environment, you may also use tab-completion to see these accessible attributes.*

In [29]:
# You can also assign a dict to a row of a DataFrame:
x = pd.DataFrame({'x': [1,2,3], 'y' : [3, 4, 5]})

In [30]:
x.iloc[1] = dict(x=9, y=99)

In [31]:
x

   x   y
0  1   3
1  9  99
2  3   5

You can use attribute access to modify an existing element of a Series or column of a DataFrame, but be careful; *if you try to use attribute access to create a new column, it creates a new attribute rather than a new column. In 0.21.0 and later, this will raise a UserWarning:*

In [32]:
df = pd.DataFrame({'one' : [1., 2., 3.]})

In [33]:
df.two = [4, 5, 6]

In [34]:
df

   one
0  1.0
1  2.0
2  3.0

***Slicing ranges***

The most robust and consistent way of slicing ranges along arbitrary axes is described in the Selection by Position section detailing the .iloc method. For now, we explain the semantics of slicing using the [] operator.
With Series, the syntax works exactly as with an ndarray, returning a slice of the values and the corresponding labels:

In [35]:
s[:5]

2000-01-01    0.438670
2000-01-02    0.605819
2000-01-03   -0.624007
2000-01-04   -0.378021
2000-01-05   -0.336679
Freq: D, Name: A, dtype: float64

In [36]:
s[::2]

2000-01-01    0.438670
2000-01-03   -0.624007
2000-01-05   -0.336679
2000-01-07   -0.425114
Freq: 2D, Name: A, dtype: float64

In [37]:
s[::-1]

2000-01-08    0.907361
2000-01-07   -0.425114
2000-01-06   -0.130804
2000-01-05   -0.336679
2000-01-04   -0.378021
2000-01-03   -0.624007
2000-01-02    0.605819
2000-01-01    0.438670
Freq: -1D, Name: A, dtype: float64

In [38]:
s2 = s.copy()

In [39]:
s2[:5] = 0

In [40]:
s2

2000-01-01    0.000000
2000-01-02    0.000000
2000-01-03    0.000000
2000-01-04    0.000000
2000-01-05    0.000000
2000-01-06   -0.130804
2000-01-07   -0.425114
2000-01-08    0.907361
Freq: D, Name: A, dtype: float64

In [41]:
df[:3]

   one
0  1.0
1  2.0
2  3.0

In [42]:
df[::-1]

   one
2  3.0
1  2.0
0  1.0

***Selecting by label***

In [43]:
dfl = pd.DataFrame(np.random.randn(5,4), columns = list('ABCD'), index=pd.date_range('20130101', periods=5))

In [44]:
dfl

                   A         B         C         D
2013-01-01 -1.000346 -0.295091  0.261839  0.751263
2013-01-02  0.954039 -1.629488 -0.356149 -0.854157
2013-01-03 -0.929877 -0.174974 -1.614322 -1.589744
2013-01-04  0.263511  0.681951 -0.209858  0.049964
2013-01-05  1.020860  2.042280 -0.306842  2.766330

In [45]:
# dfl.loc[2:3] it will be mistaken
dfl.loc['20130102' : '20130104']

                   A         B         C         D
2013-01-02  0.954039 -1.629488 -0.356149 -0.854157
2013-01-03 -0.929877 -0.174974 -1.614322 -1.589744
2013-01-04  0.263511  0.681951 -0.209858  0.049964

In [46]:
s1 = pd.Series(np.random.randn(6),index=list('abcdef'))

In [47]:
s1

a    0.572151
b   -0.569914
c    1.355825
d   -0.885864
e    0.793630
f    1.420325
dtype: float64

In [48]:
s1.loc['c':]

c    1.355825
d   -0.885864
e    0.793630
f    1.420325
dtype: float64

In [49]:
s1.loc['b']

-0.56991406579130877

In [50]:
# Note setting works as well:
s1.loc['c':] = 0

In [51]:
s1

a    0.572151
b   -0.569914
c    0.000000
d    0.000000
e    0.000000
f    0.000000
dtype: float64

In [ ]:
# Slicing with labels

In [52]:
s = pd.Series(list('abcde'), index=[0,3,2,5,4])

In [58]:
s.loc[0:]

0    a
3    b
2    c
5    d
4    e
dtype: object

In [63]:
s.sort_index()

0    a
2    c
3    b
4    e
5    d
dtype: object

In [64]:
s.sort_index().loc[1:6]

2    c
3    b
4    e
5    d
dtype: object

In [ ]:
# Selection by position

In [65]:
s1 = pd.Series(np.random.randn(5), index=list(range(0,10,2)))

In [66]:
s1

0   -0.117048
2    1.657450
4   -0.145538
6   -0.815497
8    0.526328
dtype: float64

In [67]:
s1.iloc[:3] # slice first three rows

0   -0.117048
2    1.657450
4   -0.145538
dtype: float64

In [74]:
s1.loc[:3] # slice up to and including label 3

0   -0.117048
2    1.657450
dtype: float64

In [75]:
s1.iloc[:3] = 0

In [77]:
s1

0    0.000000
2    0.000000
4    0.000000
6   -0.815497
8    0.526328
dtype: float64

In [78]:
df1 = pd.DataFrame(np.random.randn(6,4),
                      index=list(range(0,12,2)),
                      columns=list(range(0,8,2)))

In [79]:
df1

           0         2         4         6
0  -0.740144 -0.104425  0.196949 -1.372920
2  -2.401597  0.688443  0.335351  0.861908
4   0.566626  0.054429  1.193603 -1.469801
6  -0.243532 -1.161426 -1.294099 -1.146254
8   0.316514 -0.064657 -0.301730 -0.616345
10 -0.946599 -1.474914  1.619599  1.905497

In [80]:
df1.iloc[:3]

          0         2         4         6
0 -0.740144 -0.104425  0.196949 -1.372920
2 -2.401597  0.688443  0.335351  0.861908
4  0.566626  0.054429  1.193603 -1.469801

In [81]:
df1.iloc[1:5, 2:4]

          4         6
2  0.335351  0.861908
4  1.193603 -1.469801
6 -1.294099 -1.146254
8 -0.301730 -0.616345

In [82]:
df1.iloc[1]

0   -2.401597
2    0.688443
4    0.335351
6    0.861908
Name: 2, dtype: float64

In [ ]:
# Out of range slice indexes are handled gracefully just as in Python/Numpy.

In [83]:
x = list('abcdef')

In [84]:
x

['a', 'b', 'c', 'd', 'e', 'f']

In [85]:
x[0:]

['a', 'b', 'c', 'd', 'e', 'f']

In [86]:
x[4:10]

['e', 'f']

In [87]:
s = pd.Series(x)

In [88]:
s

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [89]:
s.iloc[4:10]

4    e
5    f
dtype: object

In [94]:
s.iloc[8:10]

Series([], dtype: object)

In [93]:
s.loc[4:]

4    e
5    f
dtype: object

In [ ]:
# Selection By Callable

In [96]:
df1 = pd.DataFrame(np.random.randn(6,4),
                      index=list('abcdef'),
                      columns=list('ABCD'))

In [97]:
df1

          A         B         C         D
a -0.570304  1.712515 -0.816043  0.819936
b -1.610752 -0.112926  0.478708 -1.505575
c -0.472241  1.373638 -0.636263  0.884573
d -0.505943  0.697097  1.026165 -0.193887
e  0.513560  0.250300 -0.207142 -0.651308
f  0.122724 -0.482258 -0.307921  0.726966

In [98]:
df1.loc[lambda df: df.A > 0, :]

          A         B         C         D
e  0.513560  0.250300 -0.207142 -0.651308
f  0.122724 -0.482258 -0.307921  0.726966

In [99]:
df1.loc[:, lambda df: ['A', 'B']]

          A         B
a -0.570304  1.712515
b -1.610752 -0.112926
c -0.472241  1.373638
d -0.505943  0.697097
e  0.513560  0.250300
f  0.122724 -0.482258

In [100]:
df1.loc[:, ['A', 'B']] # WTF?

          A         B
a -0.570304  1.712515
b -1.610752 -0.112926
c -0.472241  1.373638
d -0.505943  0.697097
e  0.513560  0.250300
f  0.122724 -0.482258

In [101]:
df1.iloc[:, lambda df: [0, 1]]

          A         B
a -0.570304  1.712515
b -1.610752 -0.112926
c -0.472241  1.373638
d -0.505943  0.697097
e  0.513560  0.250300
f  0.122724 -0.482258

In [103]:
df1[lambda df: df.columns[0]]

a   -0.570304
b   -1.610752
c   -0.472241
d   -0.505943
e    0.513560
f    0.122724
Name: A, dtype: float64

In [106]:
# You can use callable indexing in Series.
df1.A.loc[lambda s: s > 0]

e    0.513560
f    0.122724
Name: A, dtype: float64

In [ ]:
# Using these methods / indexers, you can chain data selection operations without using temporary variable.

In [ ]:
# Task. Try it on dataset